#pragma once

//******************************************************************************
//
//
//      ゲームシーン
//
//
//******************************************************************************

//前方宣言
class light;

//==============================================================================
//
//      Gameクラス
//
//==============================================================================

class Game : public Scene
{
public:
	static Game* instance() { return &instance_; }

	Game();

	void init();
	void deinit();
	void update();
	void draw();

private:
	bool                isPaused;

	//ライト
	light* light_;

	//バックグラウンド
	GameLib::Sprite* background_;

	static Game instance_;
};

//******************************************************************************
